loadtest.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
    - duration: 60
      arrivalRate: 20
    - duration: 60
      arrivalRate: 30
    - duration: 60
      arrivalRate: 40
    - duration: 60
      arrivalRate: 50
    - duration: 60
      arrivalRate: 60
    - duration: 60
      arrivalRate: 70
    - duration: 60
      arrivalRate: 80
    - duration: 60
      arrivalRate: 90
    - duration: 60
      arrivalRate: 100
scenarios:
  - name: "Test"
  - flow:
      - get:
          url: "/test"
      - post:
          url: "/test"
          json:
            test: "test"
      - get:
          url: "/test2"